code/openfoam/tutorials/incompressibleMultiphaseVoF/damBreak4phaseLaminar/0/alpha.oil
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.oil;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField
{
    type        zonal;

    defaultValue    0;

    zones
    {
        oil
        {
            type        box;

            box         (0.1461 0 -1) (0.2922 0.292 1);

            value       1;
        }
    }
}

boundaryField
{
    leftWall
    {
        type            alphaContactAngle;
        contactAngleProperties
        {
            air             { theta0 90; }
            water           { theta0 90; }
            mercury         { theta0 90; }
        }
    }
    rightWall
    {
        type            alphaContactAngle;
        contactAngleProperties
        {
            air             { theta0 90; }
            water           { theta0 90; }
            mercury         { theta0 90; }
        }
    }
    lowerWall
    {
        type            alphaContactAngle;
        contactAngleProperties
        {
            air             { theta0 90; }
            water           { theta0 90; }
            mercury         { theta0 90; }
        }
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
